lyusupov/SoftRF/software/firmware/source/libraries/LibAPRS_ESP32/AFSK.cpp
    i2s_set_pin(I2S_NUM_0, &pin_config);

    //Select Gpio as Digital Gpio
    rtc_gpio_deinit((gpio_num_t) MIC_PIN);

    i2s_set_clk(I2S_NUM_0, SAMPLE_RATE, BPS, I2S_CHANNEL_MONO);

    /* Stop I2S */
    // i2s_stop(I2S_NUM);
    uint16_t a, b, c;
    int rval = S3_i2s_mclk_quirk(I2S_NUM_0, &a, &b, &c);
    /* I2S start */
    // i2s_start(I2S_NUM);

    // Serial.print("rval = "); Serial.println(rval);
    // Serial.print("a = "); Serial.println(a);
    // Serial.print("b = "); Serial.println(b);
    // Serial.print("c = "); Serial.println(c);

    i2s_zero_dma_buffer(I2S_NUM_0);
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
}
#endif /* I2S_INTERNAL */

#if !defined(I2S_INTERNAL) || defined(CONFIG_IDF_TARGET_ESP32S3)
hw_timer_t *timer = NULL;

void AFSK_TimerEnable(bool sts)
{
  if (sts == true)
    timerAlarmEnable(timer);
  else
    timerAlarmDisable(timer);
}
#endif /* !I2S_INTERNAL || CONFIG_IDF_TARGET_ESP32S3 */
#endif /* ESP32 */

void AFSK_hw_init(void)
{
  // Set up ADC
  if (RSSI_PIN > 0) {
    pinMode(RSSI_PIN, INPUT_PULLUP);
  }

  if (TX_LED_PIN > 0) {
    pinMode(TX_LED_PIN, OUTPUT);
    digitalWrite(TX_LED_PIN, LOW);
  }

  if (RX_LED_PIN > 0) {
    pinMode(RX_LED_PIN, OUTPUT);
    digitalWrite(RX_LED_PIN, LOW);
  }

  if (PTT_PIN > 0) {
    pinMode(PTT_PIN, OUTPUT);
    digitalWrite(PTT_PIN, HIGH);
  }

#if defined(ESP32)
#if defined(I2S_INTERNAL) && defined(CONFIG_IDF_TARGET_ESP32)
  //  Initialize the I2S peripheral
  I2S_Init(I2S_MODE_DAC_BUILT_IN, I2S_BITS_PER_SAMPLE_16BIT);
#else
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  I2S_Init((i2s_mode_t) (I2S_MODE_TX | I2S_MODE_PDM), I2S_BITS_PER_SAMPLE_16BIT);
#else
  pinMode(MIC_PIN, INPUT);
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  // Init ADC and Characteristics
  // esp_adc_cal_characteristics_t characteristics;
  adc1_config_width(ADC_WIDTH_BIT_12);

  uint64_t mac = ESP.getEfuseMac();
  if (mac == 0x7475ac188534ULL /* || mac == 0x58f8ab188534ULL */) {
    /* work around wrong R22 value (should be 47K) issue on very first T-TWR Plus batches */
    adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_11); // Input 3.3Vp-p,Use R 10K divider input power 3.3V
  } else {
    adc1_config_channel_atten(SPK_PIN, ADC_ATTEN_DB_0);  // Input 1.24Vp-p,Use R 47K-(10K//10K) divider input power 1.2Vref
  }

  // esp_adc_cal_get_characteristics(V_REF, ADC_ATTEN_DB_11, ADC_WIDTH_BIT_12, &characteristics);
  // Serial.printf("v_ref routed to 3.3V\n");

  // Start a timer at 9.6kHz to sample the ADC and play the audio on the DAC.
  timer = timerBegin(3, 10, true);                // 80 MHz / 10 = 8MHz hardware clock
  timerAttachInterrupt(timer, &sample_isr, true); // Attaches the handler function to the timer
  timerAlarmWrite(timer, 834, true);              // Interrupts when counter == 834, 9592.3 times a second

  // timerAlarmEnable(timer);
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
#endif /* I2S_INTERNAL */
#endif /* ESP32 */
}

void AFSK_init(Afsk *afsk, bool rx)
{
  // Allocate modem struct memory
  memset(afsk, 0, sizeof(*afsk));
  AFSK_modem = afsk;
  // Set phase increment
  afsk->phaseInc = MARK_INC;

#if !defined(I2S_INTERNAL) || defined(CONFIG_IDF_TARGET_ESP32S3)
  if (rx) {
    adcq.begin(); // allocate memory for queue
  }
#endif

  // Initialise FIFO buffers
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  fifo_init(&afsk->delayFifo, (uint8_t *)afsk->delayBuf, sizeof(afsk->delayBuf));

  // Fill delay FIFO with zeroes
  for (int i = 0; i < SAMPLESPERBIT_RX / 2; i++)
  {
    fifo_push(&afsk->delayFifo, 0);
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
  fifo_init(&afsk->rxFifo, afsk->rxBuf, sizeof(afsk->rxBuf));
  fifo_init(&afsk->txFifo, afsk->txBuf, sizeof(afsk->txBuf));

  // filter initialize
  filter_param_t flt = {
      .size = FIR_LPF_N,
      .sampling_freq = SAMPLERATE,
      .pass_freq = 0,
      .cutoff_freq = 1200,
  };
  int16_t *lpf_an, *bpf_an;
  // LPF
  lpf_an = filter_coeff(&flt);
  // BPF
  flt.size = FIR_BPF_N;
  flt.pass_freq = 1000;
  flt.cutoff_freq = 2700;
  bpf_an = filter_coeff(&flt);

  // LPF
  filter_init(&lpf, lpf_an, FIR_LPF_N);
  // BPF
  filter_init(&bpf, bpf_an, FIR_BPF_N);

  AFSK_hw_init();
}

static void AFSK_txStart(Afsk *afsk)
{
  if (!afsk->sending)
  {
    fifo_flush(&AFSK_modem->txFifo);
    // Serial.println("TX Start");
    afsk->sending = true;
    afsk->phaseInc = MARK_INC;
    afsk->phaseAcc = 0;
    afsk->bitstuffCount = 0;
    // LED_TX_ON();
    if (TX_LED_PIN > 0) {
      digitalWrite(TX_LED_PIN, HIGH);
    }
    if (PTT_PIN > 0) {
      digitalWrite(PTT_PIN, LOW);
    }
    afsk->preambleLength = DIV_ROUND(custom_preamble * BITRATE, 9600);
    AFSK_DAC_IRQ_START();
#if defined(ESP32)
#if defined(I2S_INTERNAL)
    i2s_zero_dma_buffer(I2S_NUM_0);
#if defined(CONFIG_IDF_TARGET_ESP32)
    // i2s_adc_disable(I2S_NUM_0);
    dac_i2s_enable();
#endif /* CONFIG_IDF_TARGET_ESP32 */
    // i2s_start(I2S_NUM_0);
#endif /* I2S_INTERNAL */
#endif /* ESP32 */
  }
  noInterrupts();
  afsk->tailLength = DIV_ROUND(custom_tail * BITRATE, 9600);
  interrupts();
}

void afsk_putchar(char c)
{
  AFSK_txStart(AFSK_modem);
#if defined(CONFIG_IDF_TARGET_ESP32)
  while (fifo_isfull_locked(&AFSK_modem->txFifo))
  {
    /* Wait */
    // delay(10);
  }
  fifo_push_locked(&AFSK_modem->txFifo, c);
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  if (!fifo_isfull_locked(&AFSK_modem->txFifo)) {
    fifo_push_locked(&AFSK_modem->txFifo, c);
  } else {
    Serial.println("txFifo IS FULL");
  }
#endif
}

int afsk_getchar(void)
{
  if (fifo_isempty_locked(&AFSK_modem->rxFifo))
  {
    return EOF;
  }
  else
  {
    return fifo_pop_locked(&AFSK_modem->rxFifo);
  }
}

void AFSK_transmit(char *buffer, size_t size)
{
  fifo_flush(&AFSK_modem->txFifo);
  int i = 0;
  while (size--)
  {
    afsk_putchar(buffer[i++]);
  }
}

uint8_t AFSK_dac_isr(Afsk *afsk)
{
  if (afsk->sampleIndex == 0)
  {
    // LED_RX_ON();
    // digitalWrite(RX_LED_PIN), LOW);
    if (afsk->txBit == 0)
    {
      if (fifo_isempty(&afsk->txFifo) && afsk->tailLength == 0)
      {
        AFSK_DAC_IRQ_STOP();
        afsk->sending = false;
        // LED_TX_OFF();
        // digitalWrite(PTT_PIN, LOW);
        return 0;
      }
      else
      {
        if (!afsk->bitStuff)
          afsk->bitstuffCount = 0;
        afsk->bitStuff = true;
        if (afsk->preambleLength == 0)
        {
          if (fifo_isempty(&afsk->txFifo))
          {
            afsk->tailLength--;
            afsk->currentOutputByte = HDLC_FLAG;
          }
          else
          {
            afsk->currentOutputByte = fifo_pop(&afsk->txFifo);
          }
        }
        else
        {
          afsk->preambleLength--;
          afsk->currentOutputByte = HDLC_FLAG;
        }
        if (afsk->currentOutputByte == AX25_ESC)
        {
          if (fifo_isempty(&afsk->txFifo))
          {
            AFSK_DAC_IRQ_STOP();
            afsk->sending = false;
            // LED_TX_OFF();
            // digitalWrite(PTT_PIN, LOW);
            return 0;
          }
          else
          {
            afsk->currentOutputByte = fifo_pop(&afsk->txFifo);
          }
        }
        else if (afsk->currentOutputByte == HDLC_FLAG || afsk->currentOutputByte == HDLC_RESET)
        {
          afsk->bitStuff = false;
        }
      }
      afsk->txBit = 0x01;
    }

    if (afsk->bitStuff && afsk->bitstuffCount >= BIT_STUFF_LEN)
    {
      afsk->bitstuffCount = 0;
      afsk->phaseInc = SWITCH_TONE(afsk->phaseInc);
    }
    else
    {
      if (afsk->currentOutputByte & afsk->txBit)
      {
        afsk->bitstuffCount++;
      }
      else
      {
        afsk->bitstuffCount = 0;
        afsk->phaseInc = SWITCH_TONE(afsk->phaseInc);
      }
      afsk->txBit <<= 1;
    }

    afsk->sampleIndex = SAMPLESPERBIT;
  }

  afsk->phaseAcc += afsk->phaseInc;
  afsk->phaseAcc %= SIN_LEN;
  if (afsk->sampleIndex > 0)
    afsk->sampleIndex--;
  // LED_RX_OFF();

  return sinSample(afsk->phaseAcc);
}

int hdlc_flag_count = 0;
bool hdlc_flage_end = false;
static bool hdlcParse(Hdlc *hdlc, bool bit, FIFOBuffer *fifo)
{
  // Initialise a return value. We start with the
  // assumption that all is going to end well :)
  bool ret = true;

  // Bitshift our byte of demodulated bits to
  // the left by one bit, to make room for the
  // next incoming bit
  hdlc->demodulatedBits <<= 1;
  // And then put the newest bit from the
  // demodulator into the byte.
  hdlc->demodulatedBits |= bit ? 1 : 0;

