lyusupov/SoftRF/software/firmware/source/libraries/LibAPRS_ESP32/AFSK.cpp
  // BUTTERWORTH Filter
  afsk->iirX[0] = afsk->iirX[1];
  afsk->iirX[1] = ((int8_t)fifo_pop(&afsk->delayFifo) * currentSample) / 6.027339492F;
  afsk->iirY[0] = afsk->iirY[1];
  afsk->iirY[1] = afsk->iirX[0] + afsk->iirX[1] + afsk->iirY[0] * 0.6681786379F;

  // We put the sampled bit in a delay-line:
  // First we bitshift everything 1 left
  afsk->sampledBits <<= 1;
  // And then add the sampled bit to our delay line
  afsk->sampledBits |= (afsk->iirY[1] > 0) ? 1 : 0;

  // Put the current raw sample in the delay FIFO
  fifo_push(&afsk->delayFifo, currentSample);

#endif /* CONFIG_IDF_TARGET_ESP32S3 */

  // We need to check whether there is a signal transition.
  // If there is, we can recalibrate the phase of our
  // sampler to stay in sync with the transmitter. A bit of
  // explanation is required to understand how this works.
  // Since we have PHASE_MAX/PHASE_BITS = 8 samples per bit,
  // we employ a phase counter (currentPhase), that increments
  // by PHASE_BITS everytime a sample is captured. When this
  // counter reaches PHASE_MAX, it wraps around by modulus
  // PHASE_MAX. We then look at the last three samples we
  // captured and determine if the bit was a one or a zero.
  //
  // This gives us a "window" looking into the stream of
  // samples coming from the ADC. Sort of like this:
  //
  //   Past                                      Future
  //       0000000011111111000000001111111100000000
  //                   |________|
  //                       ||
  //                     Window
  //
  // Every time we detect a signal transition, we adjust
  // where this window is positioned little. How much we
  // adjust it is defined by PHASE_INC. If our current phase
  // phase counter value is less than half of PHASE_MAX (ie,
  // the window size) when a signal transition is detected,
  // add PHASE_INC to our phase counter, effectively moving
  // the window a little bit backward (to the left in the
  // illustration), inversely, if the phase counter is greater
  // than half of PHASE_MAX, we move it forward a little.
  // This way, our "window" is constantly seeking to position
  // it's center at the bit transitions. Thus, we synchronise
  // our timing to the transmitter, even if it's timing is
  // a little off compared to our own.
  if (SIGNAL_TRANSITIONED(afsk->sampledBits))
  {
    if (afsk->currentPhase < PHASE_THRESHOLD)
    {
      afsk->currentPhase += PHASE_INC;
    }
    else
    {
      afsk->currentPhase -= PHASE_INC;
    }
  }

  // We increment our phase counter
  afsk->currentPhase += PHASE_BITS;

  // Check if we have reached the end of
  // our sampling window.
  if (afsk->currentPhase >= PHASE_MAX)
  {
    // If we have, wrap around our phase
    // counter by modulus
    afsk->currentPhase %= PHASE_MAX;

    // Bitshift to make room for the next
    // bit in our stream of demodulated bits
    afsk->actualBits <<= 1;

    //// Alternative using 5 bits ////////////////
    uint8_t bits = afsk->sampledBits & 0x1f;
    uint8_t c = CountOnesFromInteger(bits);
    if (c >= 3)
      afsk->actualBits |= 1;
    /////////////////////////////////////////////////

    // Now we can pass the actual bit to the HDLC parser.
    // We are using NRZ coding, so if 2 consecutive bits
    // have the same value, we have a 1, otherwise a 0.
    // We use the TRANSITION_FOUND function to determine this.
    //
    // This is smart in combination with bit stuffing,
    // since it ensures a transmitter will never send more
    // than five consecutive 1's. When sending consecutive
    // ones, the signal stays at the same level, and if
    // this happens for longer periods of time, we would
    // not be able to synchronize our phase to the transmitter
    // and would start experiencing "bit slip".
    //
    // By combining bit-stuffing with NRZ coding, we ensure
    // that the signal will regularly make transitions
    // that we can use to synchronize our phase.
    //
    // We also check the return of the Link Control parser
    // to check if an error occured.

    if (!hdlcParse(&afsk->hdlc, !TRANSITION_FOUND(afsk->actualBits), &afsk->rxFifo))
    {
      afsk->status |= 1;
      if (fifo_isfull(&afsk->rxFifo))
      {
        fifo_flush(&afsk->rxFifo);
        afsk->status = 0;
#ifdef DEBUG_TNC
        Serial.println("FIFO IS FULL");
#endif
      }
    }
  }
}

#define ADC_SAMPLES_COUNT 768
#if defined(I2S_INTERNAL) && !defined(CONFIG_IDF_TARGET_ESP32S3)
#define ADC_SAMPLES_COUNT_IN ADC_SAMPLES_COUNT
#else
#define ADC_SAMPLES_COUNT_IN 192
#endif

int16_t abufPos = 0;
// extern TaskHandle_t taskSensorHandle;

extern void APRS_poll();
uint8_t poll_timer = 0;
// int adc_count = 0;
int offset_new = 0, offset = 2303, offset_count = 0;

#if defined(ESP32) && (!defined(I2S_INTERNAL) || defined(CONFIG_IDF_TARGET_ESP32S3))
// int x=0;
portMUX_TYPE DRAM_ATTR timerMux = portMUX_INITIALIZER_UNLOCKED;

#ifdef SQL
bool sqlActive = false;
#endif /* SQL */

void IRAM_ATTR sample_isr()
{
  // portENTER_CRITICAL_ISR(&timerMux); // ISR start

  if (hw_afsk_dac_isr)
  {
#if defined(CONFIG_IDF_TARGET_ESP32)
    uint8_t sinwave = AFSK_dac_isr(AFSK_modem);
    //   abufPos += 45;
    // sinwave =(uint8_t)(127+(sin((float)abufPos/57)*128));
    // if(abufPos>=315) abufPos=0;
    // if(x++<16) Serial.printf("%d,",sinwave);
    dacWrite(MIC_PIN, sinwave);
    if (AFSK_modem->sending == false) {
      if (PTT_PIN > 0) {
        digitalWrite(PTT_PIN, HIGH);
      }
    }
#endif /* CONFIG_IDF_TARGET_ESP32 */
  }
  else
  {
#ifdef SQL
    if (digitalRead(34) == LOW)
    {
      if (sqlActive == false)
      { // Falling Edge SQL
        log_d("RX Signal");
        sqlActive = true;
      }
#endif
      // digitalWrite(4, HIGH);
      adcVal = adc1_get_raw(SPK_PIN); // Read ADC1_0 From PIN 36(VP)
      // Auto offset level
      offset_new += adcVal;
      offset_count++;
      if (offset_count >= 192)
      {
        offset = offset_new / offset_count;
        offset_count = 0;
        offset_new = 0;
        if (offset > 3300 || offset < 1300) // Over dc offset to default
          offset = 2303;
      }
      // Convert unsign wave to sign wave form
      adcVal -= offset;
      // adcVal-=2030;
      int8_t adcR = (int8_t)((int16_t)(adcVal >> 4)); // Reduce 12bit to 8bit
      // int8_t adcR = (int8_t)(adcVal / 16); // Reduce 12bit to 8bit
      adcq.push(&adcR); // Add queue buffer
// digitalWrite(4, LOW);
#ifdef SQL
    }
    else
    {
      if (sqlActive == true)
      { // Falling Edge SQL
        log_d("End Signal");
        sqlActive = false;
      }
    }
#endif
  }
  // portEXIT_CRITICAL_ISR(&timerMux); // ISR end
}
#else
bool tx_en = false;
#endif /* I2S_INTERNAL */

